tutorials/Exreme_case/background/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include        "$FOAM_CASE/0/include/boundaryConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $k_water;

boundaryField
{
        "(outlet|walls|atmosphere)"
        {
                type       inletOutlet;
                inletValue uniform $k_water;
                value      uniform $k_water;
        }  
    
 
        "(bottom|floater)"
        {
                type    kqRWallFunction;
                value   $internalField; 
        }  

        "(oversetPatch|sides)"
        {
                patchType       overset;
                type            overset;
        }
        "(inlet)"
        {
                /*
                type       inletOutlet;
                inletValue uniform $k_water;
                value      uniform $k_water;                
                */
                #include       "$FOAM_CASE/0/include/kinlet"
        }

}


// ************************************************************************* //
