tutorials/Exreme_case/background/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |          
\*---------------------------------------------------------------------------*/          
FoamFile                                                                                 
{   
    version     2.0;
    format      ascii;
    class       volScalarField;                                                          
    location    "0";                                                                     
    object      omega;                                                                       
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //          
#include        "$FOAM_CASE/0/include/boundaryConditions"

dimensions      [0 0 -1 0 0 0 0];                                                        

internalField   uniform $omega_water;                                                            

boundaryField                                                                            
{   
	"(outlet|atmosphere)"
	{
		type	   inletOutlet;
		inletValue uniform $omega_water;
		value      uniform $omega_water;
	}

	"(bottom|floater)"
	{
		type	omegaWallFunction;
		value	$internalField;
	}

	"(oversetPatch|sides)"
        {
               patchType       overset;
               type            overset;
        }

        "(inlet)"
        {
/*		
                type	   inletOutlet;
		inletValue uniform $omega_water;
		value      uniform $omega_water;                
*/  
                #include       "$FOAM_CASE/0/include/omegainlet"
        }


        walls
        {
                //type    empty;
		type	omegaWallFunction;
		value	$internalField;
        } 

}

