tutorials/Exreme_case/background/0.orig/porosityIndex
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      porosityIndex;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(inlet|outlet|bottom|atmosphere|floater)"
    {
        type            zeroGradient;
    }
    
    "(oversetPatch|sides)"
    {
         patchType       overset;
         type            overset;
    }
    
    walls
    {
        type            zeroGradient;//empty;
    }
}


// ************************************************************************* //
